01_test_cases/02_Haroun2010_Fig1/He_10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          massTransferVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         500000;

//deltaT          1;
deltaT          10;
writeControl    adjustableRunTime;

writeInterval   10000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;
// adjustTimeStep  no;
maxCo           1;
maxAlphaCo      1;

maxDeltaT       1;


// ************************************************************************* //
